int/resources/objectRepo/xmlTemplates/ows/OWSProfileService/req_InsertAddress.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:com="http://webservices.micros.com/og/4.3/Common/" xmlns:core="http://webservices.micros.com/og/4.3/Core/" xmlns:name="http://webservices.micros.com/ows/5.1/Name.wsdl">
   <soapenv:Header>
      <core:OGHeader authToken="?" channelValidation="true" primaryLangID="E" terminalID="?" timeStamp="?" transactionID="?">
         <core:Origin entityID="?" organizationID="?" systemType="?"/>
         <core:Destination entityID="?" organizationID="?" systemType="?"/>
         <core:Intermediaries>
            <core:EndPoint entityID="?" organizationID="?" systemType="?"/>
         </core:Intermediaries>
         <core:Authentication>
            <core:UserCredentials>
               <core:UserName/>
               <core:UserPassword/>
               <core:Domain/>
               <core:SecurityId/>
            </core:UserCredentials>
            <core:Licence>
               <core:Key/>
            </core:Licence>
         </core:Authentication>
      </core:OGHeader>
   </soapenv:Header>
   <soapenv:Body>
      <name:InsertAddressRequest>
         <name:NameID source="?" type="?"/>
         <name:NameAddress addressType="?" displaySequence="?" externalId="?" inactiveDate="?" insertDate="?" insertUser="?" languageCode="?" operaId="?" otherAddressType="?" primary="?" updateDate="?" updateUser="?">
            <com:AddressLine/>
			<com:AddressLine/>
			<com:AddressLine/>
			<com:AddressLine/>
            <com:cityName/>
            <com:stateProv/>
            <com:countryCode/>
            <com:postalCode/>
            <com:barCode/>
            <com:cityExtension/>
         </name:NameAddress>
      </name:InsertAddressRequest>
   </soapenv:Body>
</soapenv:Envelope>